---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireConduitTypeSet.GetEnumerator
source: html/8671ac17-43eb-072b-a95d-7d9719401afd.htm
---
# Autodesk.Revit.DB.Electrical.WireConduitTypeSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.